{
  "abstract": false,
  "anchor": "#file-clawbot.md",
  "category": "files",
  "const": false,
  "definition": "",
  "explicit": false,
  "fullname": "clawbot.md",
  "hasAdditionalMembers": false,
  "hasDetails": false,
  "inline": false,
  "kind": "file",
  "location": {
    "column": 0,
    "file": "docs/tutorials/walkthrough/clawbot.md",
    "line": 0
  },
  "name": "clawbot.md",
  "override": false,
  "parent": null,
  "programlisting": "\\page clawbot Programming the Clawbot\n\n## Objective\n\nThis tutorial will guide you through basic programming of the VEX\nClawbot.\n\n## Intended Audience\n\nThis tutorial is intended for developers with some programming\nexperience, but with little to no experience with the PROS library. If\nyou haven't programmed before, we recommend checking out all the\n\"Introduction and Basic C Features\" sections of [this tutorial\nseries](http://www.studytonight.com/c/overview-of-c.php); you may also\nbenefit from the \"Pointers, Arrays and Strings\" sections as well\n(although they aren't as pertinent).\n\n## Goals\n\nAt the end of this tutorial you will have:\n\n- Understood the basic project structure of PROS\n- Programmed a basic chassis with \"tank\" control or \"arcade\" control\n- Programmed buttons to control the clawbot's lift\n- Programmed a joystick axis to control the clawbot's claw\n- Understood the standard subsystem module methodology\n- Programmed a dead-reckoned autonomous routine\n\n## The Clawbot\n\nHere's the robot we'll be programming:\n\n![](clawbot1.jpg)\n\nYou can follow VEX's tutorial for building this robot\n[here](https://v5beta.vex.com/parent-wrapper.php?id=v5-with-clawbot).\n\nFor the purposes of this tutorial, we've plugged in our motors into the\nfollowing ports:\n\nPort Description Port Description\n\n---\n\n1 Left Wheels 11  \n 2 12  \n 3 Claw Motor 13  \n 4 14  \n 5 Vision Sensor 15  \n 6 16  \n 7 17  \n 8 Arm Motor 18  \n 9 19  \n 10 Right Wheels 20\n\nPort 21: Radio\n\nFor the ADI:\n\nPort Description Port Description\n\n---\n\nA Left Bumper E  \n B Right Bumper F  \n C G  \n D H Arm Limit\n\n## Creating the Project\n\nWith Atom started, you can create a new PROS project by clicking the\n`PROS` menu, then click `Create new Project`.\n\nCreate a directory that you'd like to keep the source files for your\nClawbot project.\n\nPick a directory to create the new project in and click Create. The PROS\nCLI will now copy the latest kernel template into the specified\ndirectory and Atom will open it.\n\n## PROS Project Structure\n\nWhen you create your project, PROS will copy all of the files necessary\nto build your project. The structure of the project looks like:\n\n\\note\nPrior to PROS kernel 3.2.0, the `opcontrol()`, `autonomous()`, and\ninitialize functions are separated into separate files (opcontrol.cpp,\nautonomous.cpp, and initialize.cpp). After PROS kernel 3.2.0, they are\nby default kept in one file (main.cpp). These could be separated again\nif you so wish.\n\n## Drive Control\n\nLet's start with the simplest operator control setup for the clawbot -\ntank drive control. We'll map the controller's left joystick to the left\ndrive motor and the controller's right joystick to the right drive\nmotor.\n\nThe controller joystick can be read with the following function:\n\nAnd we'll set the motors with the following function:\n\nBefore we get started with the tank drive control, it's important to\nnote that in C++, smart devices have constructors that create the smart\ndevice object. Constructors are a standard C++ concept, and they're very\nimportant because a constructor is necessary to define a class for\nobjects like the motors and controllers.\n\nWe'll be calling the constructors for the motors and controller at the\nbeginning of `opcontrol()`, and then we'll run the tank drive code.\n\nTo test this code, run the following commands in the terminal window to\ncreate, build, and upload the code.\n\nThese 2 commands can be simplified to `` `prosv5 mu ``.\n\n## Arcade Control\n\nWhile tank drive control is perfectly suitable for the driving style of\nsome individuals, it is worth covering the arcade control method as\nwell. This is similar to the movement style of many video games, where\none joystick axis covers forward/backward movement and the other\njoystick covers turning.\n\nWe will take the previous tank drive control code and modify it slightly\nto become arcade control. The sum or difference of the power and turn\njoysticks will be the power values sent to the left and right wheels.\n\nAs with the tank drive code, this can be uploaded with the `prosv5 mu`\ncommand.\n\n## Arm Control\n\nNext let's control the clawbot's arm. This will not require the use of a\njoystick, but instead we will use the controller's buttons.\n\nWe will use the following function to read the button press from the\ncontroller:\n\nWe will use a different motor movement function than on the drivetrain.\nBy using the velocity-controlled movement functions, we can ensure that\nthe lift moves at a constant speed regardless of the weight that the\nlift is holding.\n\nTo actuate the lift, we will check if the upmost right trigger is\npressed or if the bottommost right trigger is pressed on the controller,\nand move the lift in that direction if so.\n\n## Claw Control\n\nWe will control the claw in the same manner as the lift, by toggling its\nmovement with a controller button.\n\n## Reading the Switches\n\nThe bump switches, or buttons, are plugged into the ADI and attached to\nthe rear of the robot. We'll monitor the status of the bump switches,\nand prevent the robot from driving backwards if the switches are\npressed.\n\nWe will be using the digital reading functionality of the ADI for this.\n\nAnd here is the updated code:\n\nWe will use a similar technique for reading the limit switch. If the\nlimit switch is pressed, then we will prevent the lift from being driven\ndown further.\n\n## Simple Autonomous\n\nThe autonomous program runs without the use of a controller. We will\nmake a simple autonomous program that drives straight.",
  "refid": "clawbot_8md",
  "static": false,
  "strong": false,
  "title": "clawbot.md",
  "url": "clawbot_8md.md#file-clawbot.md",
  "visibility": "public"
}