{
  "abstract": false,
  "anchor": "#file-wireless-upload.md",
  "category": "files",
  "const": false,
  "definition": "",
  "explicit": false,
  "fullname": "wireless-upload.md",
  "hasAdditionalMembers": false,
  "hasDetails": false,
  "inline": false,
  "kind": "file",
  "location": {
    "column": 0,
    "file": "docs/tutorials/topical/wireless-upload.md",
    "line": 0
  },
  "name": "wireless-upload.md",
  "override": false,
  "parent": null,
  "programlisting": "\\page wireless-upload Wireless Upload and Hot/Cold Linking\n\n\\note\nWireless Upload requires at least CLI 3.1.4, Kernel 3.1.6, VEXos\n1.0.5, and OkapiLib 3.3.12 (if used).\n\nPROS supports wireless upload to the V5 Brain via a V5 Controller.\nAlthough there are no special requirements to enable PROS to do this,\nfile transfer speeds are typically unacceptably slow. To make them more\nreasonable, PROS has a different method of compiling your project so\nthat the PROS kernel and other infrequently modified code are uploaded\nonce and only the code you regularly modify (e.g. opcontrol.cpp,\nautonomous.cpp, and initialize.cpp) gets transferred to the V5\nwirelessly. We call the code you upload once and never change the \"cold\nimage\" and the code that changes frequently and gets uploaded every time\nthe \"hot image.\"\n\nTo enable this compilation mode, you should open your project's Makefile\nand edit the line:\n\n```{.Makefile}\n# Set to 1 to enable hot/cold linking\nUSE_PACKAGE:=0\n```\n\nso that `USE_PACKAGE:=1`. Re-build and upload your project and PROS will\nautomatically use the new files. PROS will automatically detect when\nyou're using the same combination of libraries and decide not to\nre-upload the \"cold\" code. Verification that the library is present is\ndone with filename and checksum of the file. As a result, if you use the\nsame combination of libraries (cold image), only one copy of the cold\nimage is uploaded to the V5.\n\n## Large Projects\n\nProjects with large codebases may still take some time to upload even\nwith hot/cold linking. You may be able to reduce the size of your hot\nimage by making part of your project a library so that some code is\nincluded in the cold image. To do so, edit the following lines of your\nproject's Makefile:\n\n```{.Makefile}\n# Set this to 1 to add additional rules to compile your project as a PROS library template\nIS_LIBRARY:=0\n# TODO: CHANGE THIS!\nLIBNAME:=libbest\nVERSION:=1.0.0\n# EXCLUDE_SRC_FROM_LIB= $(SRCDIR)/unpublishedfile.c\n```\n\nChange `IS_LIBRARY` to `1` and rename the library to something of your\nchoosing. We recommend `lib<robot name>` or `lib<team number>` (e.g.\n`lib7701`) to be unique enough to avoid cause naming conflicts with\nother cold images. When compiling, PROS will include this library as\npart of the cold image. Your library should only contain files you\ninfrequently change so that you do not have to frequently upload the\ncold image. By default, the Makefile is set up to exclude your project's\nopcontrol.cpp, autonomous.cpp, and initialize.cpp files. If you change\nother files frequently, you can add lines like\n`EXCLUDE_SRC_FROM_LIB+=$(SRCDIR)/myfile.c` as needed.\n\n**An important caveat** is that code that goes into the cold image is\n**not** able to link against anything (call functions or use variables)\nin the hot image. Doing so will result in a linker error - you will be\ntold what's trying to refer to what in the hot image:\n\n    bin/libtheseus.a(lcdselector.cpp.o):(.data.inits+0x0): undefined reference to `auton::allianceInit(auton::color)'\n\nYou should refactor your code so that only \"hot\" code calls \"cold\" code\nor include the culprit file in the hot image.\n\nAn example of a modified Makefile's relevant lines is shown below:\n\n```{.Makefile}\n# Set to 1 to enable hot/cold linking\nUSE_PACKAGE=1\n\n# Set this to 1 to add additional rules to compile your project as a PROS library template\nIS_LIBRARY:=1\nLIBNAME:=libtheseus\nVERSION:=1.0.0\n# this line excludes opcontrol.c and similar files\nEXCLUDE_SRC_FROM_LIB+=$(foreach file, $(SRCDIR)/opcontrol $(SRCDIR)/initialize $(SRCDIR)/autonomous,$(foreach cext,$(CEXTS),$(file).$(cext)) $(foreach cxxext,$(CXXEXTS),$(file).$(cxxext)))\nEXCLUDE_SRC_FROM_LIB+=$(SRCDIR)/scripts             # exclude any files in the src/scripts directory\nEXCLUDE_SRC_FROM_LIB+=$(SRCDIR)/lcdselector.cpp     # exclude src/lcdselector.cpp\n```\n\n## Hot/Cold Linking Troubleshooting\n\nSince hot/cold linking involves ensuring two compiled programs interact\nconsistently, there may be additional runtime issues running in this\nmode. This section serves as a guide for debugging these sorts of\nissues.\n\nGenerally, if the program appears to be running correctly (i.e. the\nscreen shows), then the compilation mode worked correctly and the error\nyou're experiencing is likely related to your code's logic. If your\ncode's logic runs correctly when not using hot/cold linking, contact us\nso we may assist in troubleshooting.\n\nIf you see a black scren, then PROS did not boot correctly.\n\n- A global constructor is in an infinite loop or raised an exception.\n- See also troubleshooting steps below\n\nIf you see a grey screen, then PROS booted correctly, but is not running\nyour hot image.\n\n- Delete all user programs, perform a clean build, and upload\n\nIf you're having issues, contact us so we may assist in troubleshooting.",
  "refid": "wireless-upload_8md",
  "static": false,
  "strong": false,
  "title": "wireless-upload.md",
  "url": "wireless-upload_8md.md#file-wireless-upload.md",
  "visibility": "public"
}